tutorials/untested/BulbPimpleWedge/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28;
    }
    thermodynamics
    {
        // Cp              29.98;
        // Cp              520.6768799;
        Cp              1070.23;            // -- J/kg/K
        Hf              0;
        Tref              0;
    }
    transport
    {
        //~ mu              1.831e-05;
        //~ Pr              0.705;
        As              2.08E-06;
        Ts              110.0;
    }
}


// ************************************************************************* //
