tutorials/untested/BulbPimpleWedge/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 0.0 0.0 )	// 000
	 ( 0.053008652692062605 0.0 0.0 )	// 001
	 ( 0.053008652692062605 0.00208 -1.8150963471792698e-05 )	// 002
	 ( 0.0 0.00208 -1.8150963471792698e-05 )	// 003
	 ( 0.053008652692062605 0.00208 1.8150963471792698e-05 )	// 004
	 ( 0.0 0.00208 1.8150963471792698e-05 )	// 005
	 ( 0.053008652692062605 0.00308 -2.687738821784688e-05 )	// 006
	 ( 0.0 0.00308 -2.687738821784688e-05 )	// 007
	 ( 0.053008652692062605 0.00308 2.687738821784688e-05 )	// 008
	 ( 0.0 0.00308 2.687738821784688e-05 )	// 009
	 ( 0.1389086526920626 0.0 0.0 )	// 010
	 ( 0.1389086526920626 0.00208 -1.8150963471792698e-05 )	// 011
	 ( 0.1389086526920626 0.00208 1.8150963471792698e-05 )	// 012
	 ( 0.19191730538412521 0.0 0.0 )	// 013
	 ( 0.19191730538412521 0.00208 -1.8150963471792698e-05 )	// 014
	 ( 0.19191730538412521 0.00208 1.8150963471792698e-05 )	// 015
	 ( 0.19191730538412521 0.00308 -2.687738821784688e-05 )	// 016
	 ( 0.1389086526920626 0.00308 -2.687738821784688e-05 )	// 017
	 ( 0.19191730538412521 0.00308 2.687738821784688e-05 )	// 018
	 ( 0.1389086526920626 0.00308 2.687738821784688e-05 )	// 019
); 

edges 
( 
	arc 7 6
		( 0.026504326346031302 0.029584326346031302 -0.0002581653975213503 )
	arc 9 8
		( 0.026504326346031302 0.029584326346031302 0.0002581653975213503 )
	arc 17 16
		( 0.1654129790380939 0.029584326346031302 -0.0002581653975213503 )
	arc 19 18
		( 0.1654129790380939 0.029584326346031302 0.0002581653975213503 )
); 

blocks 
( 
	hex
		( 0  1  2  3  0  1  4  5)	( 53  6  1)	simpleGrading 	( 0.1  1.0  1.0)

	hex
		( 3  2  6  7  5  4  8  9)	( 53  10  1)	simpleGrading 	( 0.1  1.0  1.0)

	hex
		( 1  10  11  2  1  10  12  4)	( 172  6  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 10  13  14  11  10  13  15  12)	( 53  6  1)	simpleGrading 	( 10  1.0  1.0)

	hex
		( 11  14  16  17  12  15  18  19)	( 53  10  1)	simpleGrading 	( 10  1.0  1.0)

); 

boundary 
( 
	wedgeZ0
	{
		type wedge;
		faces
		(
			( 0  1  2  3)
			( 3  2  6  7)
			( 1  10  11  2)
			( 10  13  14  11)
			( 11  14  16  17)
		);
	}

	wedgeZE
	{
		type wedge;
		faces
		(
			( 0  1  4  5)
			( 5  4  8  9)
			( 1  10  12  4)
			( 10  13  15  12)
			( 12  15  18  19)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 0  3  5  0)
			( 3  7  9  5)
			( 2  6  8  4)
			( 7  6  8  9)
			( 2  11  12  4)
			( 13  14  15  13)
			( 11  17  19  12)
			( 14  16  18  15)
			( 17  16  18  19)
		);
	}

); 

mergePatchPairs 
( 
); 

